{
    "firstname": "Paul",
    "lastname": "Brown",
    "github_id": "pawl",
    "email": "paul90brown+resume@gmail.com",
    "phone": "+1 (817) 382-9696",
    "website": "paulsprogrammingnotes.com",
    "summary": {
        "points": [
            "Full-stack developer specializing in data-driven Python & Javascript web applications."
        ]
    },
    "github_projects": {
        "details": [
            {
                "project_name": "pawl/heckingoodboys",
                "website": "heckingoodboys.com",
                "description": [
                    "A regularly updated slideshow with some of the most wonderful dog pictures."
                ]
            }
        ]
    },
    "skills": {
        "items": [
            ["Python", "Javascript", "Django", "Flask", "Vue.js"],
            ["Docker", "MySQL", "MongoDB", "PostgreSQL", "Linux"],
            ["PHP", "SQLAlchemy", "jQuery", "Bootstrap", "Jinja2"]
        ]
    },
    "experience": {
        "items": [
            {
                "title": "Software Engineer",
                "organisation": "Doctor On Demand",
                "location": "Remote",
                "from": "July 2020",
                "to": "Present",
                "details": [
                    "Worked on the Platform Engineering team to improve shared code and overall reliability of the company's Django telemedicine platform.",
                    "Helped improve CI build pipeline speed by more than 300%.",
                    "Helped containerize application and improved deployment speed.",
                    "Migrated from Python 2.7 to 3.7 and Django 1.11 to 3.2.",
                    "Improved Mypy (type hinting) implementation and used it to find bugs.",
                    "Improved application performance by reducing query counts and adding missing database indexes.",
                    "Implemented Sentry for error monitoring and used it to catch bugs early in the development process."
                ]
            },
            {
                "title": "Full-Stack Engineer",
                "organisation": "Bloodbuy.com",
                "location": "Dallas, TX",
                "from": "Jan. 2018",
                "to": "June 2020",
                "details": [
                    "Built well-tested features for a built-from-scratch Django e-commerce marketplace.",
                    "Improved application performance by simplifying database schema and reducing query counts.",
                    "Developed ETL pipeline for getting delivery data from carriers.",
                    "Improved e-mail template browser compatibility with MJML.",
                    "Improved organization security by implementing password manager and improving network security.",
                    "Dockerized application and moved testing from Jenkins to CircleCI.",
                    "Deployed software using Heroku."
                ]
            },
            {
                "title": "Senior Software Engineer",
                "organisation": "rewardStyle",
                "location": "Dallas, TX",
                "from": "Mar. 2015",
                "to": "Jan. 2018",
                "details": [
                    "Built RESTful API using Python, Flask, and SQLAlchemy for the launch of the LIKEtoKNOW.it mobile app.",
                    "Improved caching, performance, and scalability of LIKEtoKNOW.it.",
                    "Used Docker to containerize applications.",
                    "Built microservices using the Apache Thrift RPC framework.",
                    "Developed ETL pipelines to upsert 30+ million rows into a MySQL database daily.",
                    "Improved accuracy of customer facing analytics.",
                    "Assisted with engineer onboarding, code review, and bug fixes to Node.js, PHP, and Python software.",
                    "Deployed software on AWS infrastructure using Ansible."
                ]
            },
            {
                "title": "Engineer I",
                "organisation": "Ericsson",
                "location": "Plano, TX",
                "from": "Aug. 2013",
                "to": "Mar. 2015",
                "details": [
                    "Won an Ericsson PRIDE Award in the category of Processes & Tools. One of only 29 employees (out of approx. 8,000) to receive this award.",
                    "Used Python, Flask, and SQLAlchemy to develop database-driven web applications to provide useful insights from raw data.",
                    "Created Python tools to automate data aggregation, scraping, and report generation.",
                    "Gathered requirements from engineers and took ideas from prototype to launch."
                ]
            },
            {
                "title": "Software Development Intern",
                "organisation": "Ericsson",
                "location": "Plano, TX",
                "from": "Aug. 2012",
                "to": "Aug. 2013",
                "details": [
                    "Built widely used internal web application using a web framework (PHP's Yii).",
                    "Gained Python experience while creating scripts to automate tasks for network engineers.",
                    "Learned to use Git and resolve merge conflicts as I worked with other developers.",
                    "Created an iOS application using Phonegap.",
                    "Became skilled at creating charts using Javascript charting libraries.",
                    "Provided Sharepoint support to coworkers."
                ]
            }
        ]
    },
    "education": {
        "schools": [
            {
                "degree": "Bachelors",
                "major": "Computer Science",
                "institution": "Thomas Edison State University",
                "graduation_year": 2013
            }
        ]
    },
    "volunteer_work": {
        "items": [
            {
                "title": "Treasurer",
                "organisation": "Dallas Makerspace",
                "from": "Feb. 2013",
                "to": "Dec. 2014",
                "details": [
                    "Handled bookkeeping with Quickbooks, accounting, reporting, and billing.",
                    "Served on Board of Directors from May 2013 until May 2014."
                ]
            }
        ]
    }
}
